#------------------------------------------------------------------------------
#   Part-I SC-System Management Choice
#------------------------------------------------------------------------------

# 1) User Grade Levels
# ----------------------------------------------------------------------------------------------------------
# Permissions in REST framework are always defined as a list of [permission classes].
# [1] AllowAny : allow access to any user
# [2] IsAuthenticated :  allow access to any authenticated user, and deny access to any unauthenticated user.
# [3] IsAuthenticatedOrReadOnly : allow full access to authenticated users, but allow read-only access to unauthenticated users.
# [4] IsAuthorUpdateOrReadOnly :  allow update access to author users, but allow read-only access to unauthenticated users.
# [5] IsAdminUser : user.is_staff is True
# [6] IsOwnerOrReadOnly : allow owners of an object to edit it
# ----------------------------------------------------------------------------------------------------------
# Admin Site = [is_active, is_staff, is_admin, is_superuser]
# - auth = True if self.request.user in [context['sound'].manager, context['sound'].collector] else False
# - m_Auth = 100 if auth or user.is_superuser or (user.is_staff and user.level == '1'), #SC 관리자-1
# - m_Auth = 200 if user.is_staff and user.level == '2', #SC 관리자-2
# - m_Auth = 300 if user.is_staff and user.level == '3', #SC-로그인 사용자
# - m_Auth = 400, #SC 미인증 사용자
# ----------------------------------------------------------------------------------------------------------
LEVEL_CHOICES = (
    ("4", "Lv4_미인증사용자"),   #SC미인증 : [Target, Collect, 커뮤니티] 접속제한
    ("3", "Lv3_인증사용자"),     #SC로그인 : [커뮤니티-자유게시판] 신규등록권한 및 본인등록-갱신권한 보유
    ("2", "Lv2_관리자-2"),      #SC관리-2 : [Target, Collect, 커뮤니티-자료실/자유게시판] 신규등록권한 및 본인등록-갱신권한 보유
    ("1", "Lv1_관리자-1"),      #SC관리-1 : [Target, Collect, 커뮤니티-공지사항/자료실/자유게시판] 신규등록권한 및 본인/타인등록 갱신권한 보유
    ("0", "Lv0_개발자"),        #SCAdmin : 개발자 권한 보유
)

# 2) free APP choiceField
CATEGORY_CHOICES = (("자유", "자유"), ("질문", "질문"), ("정보", "정보"),)


#------------------------------------------------------------------------------
#   Part-II Basic Choice
#------------------------------------------------------------------------------

# 1. Player 2 Type(생물, 사물)
PLAYER_OBJECT = ((1, '생물'), (2, '사물'),)


# 2. Player 17 Species Type
SPECIES_TYPE = ((0, "미정"), (1, "맹수류"), (2, "야수류"), (3, "가축류"), (4, "애완류"), (5, "텃새류"), (6, "가금류"),
                (7, "동철새"), (8, "하철새"), (9, "곤충류"), (10, "양서류"), (11, "유수군"), (12, "낙수군"), (13, "파도군"),
                (14, "바람군"), (15, "천둥군"), (16, "사찰군"), (17, "항구군"),)

# 3. 2 Habitat Type
HABITAT_TYPE = ((1, "육지"), (2, "바다"),)

# 4. 3 Daily Type
DAILY_TYPE = ((0, "미정"), (1, "주간"), (2, "야간"), (3, "주야"),)

# 5. Player 2 Sound Group Type
GROUP_TYPE = ((0, "미정"), (1, "솔로"), (2, "군집"),)

# 6. Player 6 Notional Sound Type
NOTIONAL_TYPE = ((0, "미정"), (1, "일과알림"), (2, "손님맞이"), (3, "모성"), (4, "애환"), (5, "풍년"), (6, "번영"),
                 (7, "행운"), (8, "평화"), (9, "성실"), (10, "용맹"), (11, "집귀퇴치"), (12, "흉조"),)


# 7. Player 24 Season Type
SEASON24_TYPE = ((0, "    미정       "), (1, "01) 입춘(02-04)"), (2, "02) 우수(02-19)"), (3, "03) 경칩(03-06)"),
                 (4, "04) 춘분(03-21)"), (5, "05) 청명(04-05)"), (6, "06) 곡우(04-20)"), (7, "07) 입하(05-06)"),
                 (8, "08) 소만(05-21)"), (9, "09) 망종(06-06)"), (10, "10) 하지(06-21)"), (11, "11) 소서(07-07)"),
                 (12, "12) 대서(07-23)"), (13, "13) 입추(08-08)"), (14, "14) 처서(08-23)"), (15, "15) 백로(09-08)"),
                 (16, "16) 추분(09-23)"), (17, "17) 한로(10-08)"), (18, "18) 상강(10-23)"), (19, "19) 입동(11-07)"),
                 (20, "20) 소설(11-22)"), (21, "21) 대설(12-07)"), (22, "22) 동지(12-22)"), (23, "23) 소한(01-06)"),
                 (24, "24) 대한(01-21)"),)


# 8. Player Sound Start & Stop Time Type
SOUND_TIME = ((0, "00분경"), (10, "10분경"), (20, "20분경"), (30, "30분경"), (40, "40분경"), (50, "50분경"), (60, "60분경"),
              (70, "70분경"), (80, "80경분"))



# 9. Player Sound Act Type
ACT_TYPE = ((0, "미정"), (1, "단막(1-리듬)"), (2, "연막(2-리듬)"), (3, "중막(3리듬)"), (4, "장막(n-리듬)"))


#------------------------------------------------------------------------------
#   Part-III Smart Choice
#------------------------------------------------------------------------------

# 1. [PlayerSectSub] 서브 모델 설정 : 생물 ~ 사물
PLAYER_SECT_SUB = [
    ('생물', ((1, '포유류'), (2, '조류'), (3, '곤충류'), (4, '양서류'))),
    ('사물', ((5, '자연물'), (6, '인공물')))
]

# 2. [Player Target] 서브 모델 설정 : 포유류 ~ 인공물
SPECIES_SECT_SUB = [
    ('포유류', ((10, "미정"), (11, "맹수류"), (12, "야수류"), (13, "가축류"), (14, "애완류"))),
    ('조류', ((20, "미정"), (21, "동철새"), (22, "하철새"), (23, "텃새류"), (24, "가금류"), (25, "애완류"))),
    ('곤충류', ((30, "미정"), (31, "매미군"), (32, "귀뚜라미군"), (33, "여치군"), (34, "땅강아지군"), (35, "메뚜기군"), (36, "벌군"))),
    ('양서류', ((40, "미정"), (41, "개구리군"), (42, "맹꽁이군"), (43, "두꺼비군"))),
    ('자연물', ((50, "미정"), (51, "유수군"), (52, "낙수군"), (53, "파도군"), (54, "바람군"), (55, "천둥군"))),
    ('인공물', ((60, "미정"), (61, "농가군"), (62, "사찰군"), (63, "항구군")))
]

# 3. [Player Ecology] 서브 모델 설정 : 발성생태
ECOLOGY_SECT_SUB = [
    ('생물', ((10, "미정"), (11, "영역알림"), (12, "새끼방어"), (13, "구애활동"), (14, "육추쟁탈"), (15, "새끼호출"),
             (16, "어미호출"), (17, "소통학습"), (18, "종족소통"), (19, "도망회피"))),
    ('사물', ((20, "미정"), (21, "자연생태"), (22, "인공생태")))
]

# 4. [Player Emotion] 서브 모델 설정 : 발성감성
EMOTION_SECT_SUB = [
    ('생물', ((10, "미정"), (11, "구슬픈.처연한"), (12, "평화.여유로운"), (13, "훈훈한.정겨운"), (14, "친근한.친숙한"),
             (15, "정갈한.상쾌한"), (16, "활기찬.유쾌한"), (17, "공포.불안.살벌"), (18, "특이.괴기.이상"),
             (19, "단조.혐오.짜증"))),
    ('사물', ((20, "미정"), (21, "평온한.편안한"), (22, "친근한.친숙한"), (23, "정갈한.상쾌한"), (24, "활기찬.유쾌한"),
             (25, "웅장한.통쾌한"), (26, "공포.불안.살벌"), (27, "특이.괴기.이상"), (28, "단조.혐오.짜증")))
]

# 5. [Player Sex] 서브 모델 설정 : 발성성체
SEX_SECT_SUB = [
    ('생물', ((10, "미정"), (11, "새끼"), (12, "성체암컷"), (13, "성체수컷"), (14, "성체일반"))),
    ('사물', ((20, "미정"), (21, "LF-연속음"), (22, "LF-연간헐음"), (23, "LF-간헐음"), (24, "HF-연속음"), (25, "HF-연간헐음"),
            (26, "HF-간헐음")))
]

# 6. [Player Vitality] 서브 모델 설정 : 발성활력
VITALITY_SECT_SUB = [
    ('생물', ((10, "미정"), (11, "적막한"), (12, "고요한"), (13, "평온한"), (14, "활기찬"), (15, "요란한"), (16, "격렬한"))),
    ('사물', ((20, "미정"), (21, "적막한"), (22, "고요한"), (23, "평온한"), (24, "활기찬"), (25, "격렬한"), (26, "웅장한")))
]

# 7. [Player Life Sect Sub] 서브 모델 설정 : 야생군 ~ 인공물
LIFE_SECT_SUB = [
    ('생물', ((1, '야생군'), (2, '가생군'), (3, '애완군'))),
    ('사물', ((4, '자연환경'), (5, '인공환경')))
]

# 8. [Player Stage Sect Sub] 서브 모델 설정 : 산중계곡 ~ 해변민가
STAGE_SECT_SUB = [
    ('육지', ((10, "미정"), (11, "산중계곡"), (12, "산중동굴"), (13, "민가야산"), (14, "들강호수"), (15, "시골민가"), (16, "동물우리"))),
    ('바다', ((20, "미정"), (21, "해변백사"), (22, "해변몽돌"), (23, "해안절벽"), (24, "해안동굴"), (25, "해변갯벌"), (26, "해변민가")))
]


# 9. [Player Hybrid Sect Sub] 서브 모델 설정 : 비혼성 ~ 생물사물복합혼성
HYBRID_SECT_SUB = [
    ('생물', ((10, "미정"), (11, "비혼성"), (12, "동종생물복합혼성"), (13, "동형생물복합혼성"), (14, "이종생물복합혼성"),
            (15, "자연물복합혼성"), (16, "인공물복합혼성"), (17, "자연인공복합혼성"), (18, "생물사물복합혼성"))),
    ('사물', ((20, "미정"), (21, "비혼성"), (22, "동종사물복합혼성"), (23, "동형사물복합혼성"), (24, "이종사물복합혼성"),
            (25, "이종생물복합혼성"), (26, "생물사물복합혼성")))
]


#------------------------------------------------------------------------------
#   Part-IV Multiple Choice for [get_list_display()]
#------------------------------------------------------------------------------

# 1. Multiple Choice for [PlayerSoundModel] 설정
PLAYER_SOUND = (('id', '번호'), ('obj', '종구분'), ('species', '종유형'), ('species_sub', '종타입'), ('target', '종타켓'),
                ('vitality', '발성활력 유형'), ('ecology', '발성생태 유형'), ('emotion', '발성감성 유형'), ('sex', '발성성체 유형'),
                ('hybrid', '혼성상태 유형'), ('play_sound', '채집음원 재생'), ('habitat', '서식지'), ('stage', '발성장소 유형'),
                ('group', '발성그룹 유형'), ('notion', '발성관념 유형'), ('act', '음원리듬 유형'), ('place', '채집장소'),
                ('collector', '채집자'), ('srate', '샘플링 주기[Hz]'), ('schannel', '채널 수[개]'), ('swidth', '음폭[byte]'),
                ('sduration', '재생시간[분]'), ('ssize', '용량[Mb]'), ('snr', 'SNR[dB]'), ('cdate', '채집날짜'),
                ('rdate', '등록날짜'), ('manager', '관리자'), ('nstate', '정규화 여부'), ('dstate', '삭제여부'),
                ('confirm','인증여부'), ('hits', '조회수'))

# 2. Multiple Choice for [PlayerTargetModel] 설정
PLAYER_TARGET = (('id', '번호'), ('obj', '종구분'), ('species', '종유형'), ('species_sub', '종타입'), ('name', '종이름'),
                ('life_ecology', '생태속성'), ('habitat', '서식지'), ('daily', '활동시간'), ('daily_start', '활동시작'),
                ('daily_stop', '활동종료'), ('season_start', '시작절기'), ('season_end', '종료절기'), ('rdate', '등록날짜'),
                ('dstate', '삭제여부'), ('manager', '관리자'), ('confirm', '인증여부'), ('hits', '조회수'))


# 3. Set Common Parm 설정
# 1) Global Variable to control [Progress Bar] of [normalize_selected_items] Action in [Django-Admin Changelist], 2021.09.15
SC_PROGRESS_VAL = 0
SC_PROGRESS_MAX = None

# 2) 채집음원 품질검증 처리 관련 전역변수 설정('sound_write.html'), 2021.08.31
SC_RMS_STEP = 100       #(설정주의 : 60 ~ 120)
SC_MAX_MIN_NUM = 6      #(설정주의 : 4 ~ 10)

# 3) List View의 [paginate_by] 전역변수 설정, 2021.09.23
SC_PAGINATE_BY = 12